setwd('C:/Users/User/공공 빅데이터 인턴십/프로젝트/프로젝트_데이터_코드')
train <- read.csv('2_수도권_회귀_데이터_train.csv', encoding = 'cp949')
test <- read.csv('2_수도권_회귀_데이터_test.csv', encoding = 'cp949')
head(train)


# 1. ['N1인_가구수', '가구원_모두_65세이상_가구수', '병원_병상수', '병원_의료인수', '유흥주점영업수']
lm1 <- lm(확진자수~N1인_가구수+가구원_모두_65세이상_가구수+병원_병상수+병원_의료인수+유흥주점영업수, data = train)
summary(lm1)


# 2. ['N1인_가구수', '병원_병상수', '병원_의료인수', '유흥주점영업수']
lm2 <- lm(확진자수~N1인_가구수+병원_병상수+병원_의료인수+유흥주점영업수, data = train)
summary(lm2)

# 3. anova
anova(lm1, lm2)
# p-value가 낮으므로 lm2에서 제거한 가구원_모두_65세이상_가구수 변수는 회귀모형에 대한 기여도가 높음을 알 수 있음
